# StairstypeRightSupportLateralOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeRightSupportLateralOffset Property
ParameterTypeId Class See Also
---
"Right Lateral Offset":
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeRightSupportLateralOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeRightSupportLateralOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeRightSupportLateralOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace